//1. Написать скриптик, который сосчитает и выведет результат от возведения 2 в степень 10, начиная со степени 1

// let pow = 3; //base
// pow **= 2;   //exponent
// console.log(pow)

//1*. Преобразовать 1 задачу в функцию, принимающую на вход степень, в которую будет возводиться число 2

// function pow(a, b) {
//     let result = a;
//     for (let i = 1; i < b; i++) {
//       result *= a;
//     }
//     return result;
//   }

// console.log(pow(2, 10))

//2. Написать скрипт, который выведет 5 строк в консоль т.о.:
// Пример в консоли:
// :)
// :):)
// :):):)
// :):):):)
// :):):):):)

// smile = [':)', ':):)',':):):)', ':):):):)', ':):):):):)']
// for(let i=0; i<smile.length; i++){
// console.log(smile[i])
// }

//2*. Преобразовать 2 задачу в функцию, принимающую на вход строку, которая и будет выводиться в консоль (как в условии смайлик), а также количество строк для вывода
//e.g. function printSmile(stroka, numberOfRows)


function printSmile(stroka, numberOfRows){

}


// 3**.  Написать функцию, которая принимает на вход слово. Задача функции посчитать и вывести в консоль, сколько в слове гласных, и сколько согласных букв.
// e.g. function getWordStructure(word)
// В консоли:
// Слово (word) состоит из  (число) гласных и (число) согласных букв
//Проверки: 'case', 'Case', 'Check-list'


// 4**. Написать функцию, которая проверяет, является ли слово палиндромом
// e.g. function isPalindrom(word)

// Проверки: 'abba', 'Abba'